{"keras_version": "2.1.1", "config": [{"config": {"batch_input_shape": [null, 2, 19], "mask_value": -1, "name": "masking_1", "dtype": "float32", "trainable": true}, "class_name": "Masking"}, {"config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "recurrent_dropout": 0.0, "go_backwards": false, "recurrent_constraint": null, "unroll": false, "return_sequences": false, "kernel_regularizer": null, "name": "lstm_1", "implementation": 1, "dropout": 0.2, "kernel_constraint": null, "dtype": "float32", "stateful": false, "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "return_state": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "batch_input_shape": [null, 2, 19], "bias_regularizer": null, "units": 32, "bias_constraint": null, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "dtype": "float32", "trainable": true, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 32], "bias_regularizer": null, "units": 10, "bias_constraint": null, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow"}