{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.1", "config": [{"class_name": "Masking", "config": {"name": "masking_1", "dtype": "float32", "trainable": true, "batch_input_shape": [null, 3, 35], "mask_value": -1}}, {"class_name": "LSTM", "config": {"activation": "tanh", "dtype": "float32", "recurrent_activation": "hard_sigmoid", "return_sequences": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "recurrent_constraint": null, "dropout": 0.0, "recurrent_regularizer": null, "units": 32, "return_state": false, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "lstm_1", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "implementation": 1, "activity_regularizer": null, "unit_forget_bias": true, "go_backwards": false, "batch_input_shape": [null, 3, 35], "use_bias": true, "recurrent_dropout": 0.0, "unroll": false, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "linear", "name": "dense_1", "dtype": "float32", "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "batch_input_shape": [null, 32], "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "units": 18, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "softmax", "name": "activation_1", "trainable": true}}]}