{"class_name": "Sequential", "keras_version": "2.1.1", "config": [{"class_name": "Masking", "config": {"name": "masking_1", "mask_value": -1, "trainable": true, "dtype": "float32", "batch_input_shape": [null, 3, 13]}}, {"class_name": "LSTM", "config": {"use_bias": true, "recurrent_regularizer": null, "activity_regularizer": null, "unit_forget_bias": true, "trainable": true, "dtype": "float32", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "name": "lstm_1", "stateful": false, "kernel_constraint": null, "activation": "tanh", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "unroll": false, "units": 32, "recurrent_constraint": null, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "return_state": false, "implementation": 1, "batch_input_shape": [null, 3, 13], "return_sequences": false, "dropout": 0.2, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true, "activity_regularizer": null, "dtype": "float32", "name": "dense_1", "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "batch_input_shape": [null, 32], "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 7}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}}], "backend": "tensorflow"}