{"config": [{"config": {"mask_value": -1, "dtype": "float32", "name": "masking_1", "trainable": true, "batch_input_shape": [null, 2, 12]}, "class_name": "Masking"}, {"config": {"unroll": false, "return_state": false, "unit_forget_bias": true, "dtype": "float32", "bias_constraint": null, "go_backwards": false, "batch_input_shape": [null, 2, 12], "units": 32, "recurrent_constraint": null, "activation": "tanh", "trainable": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "return_sequences": false, "dropout": 0.2, "implementation": 1, "name": "lstm_1", "recurrent_dropout": 0.0, "activity_regularizer": null, "kernel_regularizer": null, "stateful": false, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "LSTM"}, {"config": {"units": 5, "activation": "linear", "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 32], "bias_regularizer": null, "activity_regularizer": null, "dtype": "float32", "name": "dense_1", "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"activation": "softmax", "name": "activation_1", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "2.1.1", "backend": "tensorflow"}